In [367]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

**Business Problem:** 

**A game company wants to create level-based new customer definitions (personas) by using some features of its customers, and create segments according to these new customer definitions and to estimate how much the new customers who may come to these segments can earn on average.**

## Task 1

**1 - Read csv file and get general info**

In [368]:
df = pd.read_csv('persona.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [369]:
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

**2 - How many unique SOURCE are there ?**

In [370]:
df['SOURCE'].nunique()

2

**3 - How many uniqie PRICE are there ?**

In [371]:
df['PRICE'].nunique()

6

**4 - How many sales made for each PRICE ?**

In [372]:
df['PRICE'].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

**5 - How many sales made for each COUNTRY ?**

In [373]:
df['COUNTRY'].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

**6 - What is the total amount earned from sales by country?**

In [374]:
df.groupby('COUNTRY').agg({'PRICE': 'sum'})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

**7 - What are the number of sales according to SOURCE ?**

In [375]:
df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

**8 - What are the means of PRICE according to COUNTRY ?**

In [376]:
df.groupby('COUNTRY').agg({'PRICE': 'mean'})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

**9 - What are the means of PRICE according to SOURCE ?**

In [377]:
df.groupby('SOURCE').agg({'PRICE': 'mean'})

             PRICE
SOURCE
android  34.174849
ios      34.069102

**10 - What are the means of PRICE according to SOURCE ?**

In [378]:
df.groupby(['COUNTRY', 'SOURCE']).agg({'PRICE': 'mean'}).head()

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888

## Task 2

**What are the average gains in COUNTRY, SOURCE, SEX, AGE breakdown?**

In [379]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).head()

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897

## Task 3

**Sort values according to PRICE and assing dataframe called agg_df**

In [380]:
agg_df = df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).sort_values(by='PRICE', ascending=False)

In [381]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

## Task 4

**Turn the names in the index into variable names.**

In [382]:
agg_df.reset_index(inplace=True)

In [383]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

## Task 5

**Turn the AGE variable into Category and assing called AGE_CAT variable.**

In [384]:
agg_df['AGE_CAT'] = agg_df['AGE'].astype('category')

In [385]:
agg_df['AGE_CAT'] = pd.cut(x=agg_df['AGE_CAT'], bins=[0, 18, 23, 30, 40, 70], 
                       labels=['0_18', '19_23', '24_30', '31_40', '41_70'])

In [386]:
agg_df.head(8)

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_70
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40
5     deu  android  female   51   49.0   41_70
6     deu      ios    male   20   49.0   19_23
7     usa  android  female   47   49.0   41_70

## Task 6

**Define new persona**

In [387]:
agg_df['customers_level_based'] = [col[0].upper() + "_" + col[1].upper() + 
                                    "_" + col[2].upper() + "_" + col[5].upper() for col in agg_df.values]

In [388]:
agg_df = agg_df[['customers_level_based', 'PRICE']]

In [389]:
agg_df.head()

      customers_level_based  PRICE
0    BRA_ANDROID_MALE_41_70   59.0
1    USA_ANDROID_MALE_31_40   59.0
2  FRA_ANDROID_FEMALE_24_30   59.0
3        USA_IOS_MALE_31_40   54.0
4  DEU_ANDROID_FEMALE_31_40   49.0

In [390]:
agg_df = agg_df.groupby('customers_level_based').agg({'PRICE': 'mean'})
agg_df.head(10)

                              PRICE
customers_level_based
BRA_ANDROID_FEMALE_0_18   35.645303
BRA_ANDROID_FEMALE_19_23  34.077340
BRA_ANDROID_FEMALE_24_30  33.863946
BRA_ANDROID_FEMALE_31_40  34.898326
BRA_ANDROID_FEMALE_41_70  36.737179
BRA_ANDROID_MALE_0_18     34.805861
BRA_ANDROID_MALE_19_23    31.673243
BRA_ANDROID_MALE_24_30    33.413919
BRA_ANDROID_MALE_31_40    34.327381
BRA_ANDROID_MALE_41_70    40.041667

## Task 7

**Segment new customers.**

In [391]:
agg_df['SEGMENTS'] = pd.qcut(agg_df_mean['PRICE'], 4, labels=['D', 'C', 'B', 'A'])

In [392]:
agg_df.head()

                              PRICE SEGMENTS
customers_level_based
BRA_ANDROID_FEMALE_0_18   35.645303        B
BRA_ANDROID_FEMALE_19_23  34.077340        C
BRA_ANDROID_FEMALE_24_30  33.863946        C
BRA_ANDROID_FEMALE_31_40  34.898326        B
BRA_ANDROID_FEMALE_41_70  36.737179        A

In [393]:
agg_df.groupby('SEGMENTS').agg({'PRICE': ['mean', 'max', 'sum']})

              PRICE
               mean        max          sum
SEGMENTS
D         29.206780  32.333333   817.789833
C         33.509674  34.077340   904.761209
B         34.999645  36.000000   944.990411
A         38.691234  45.428571  1044.663328

## Task 8

**Predict how the company much will earn from new customers.**

In [394]:
agg_df.loc['TUR_ANDROID_FEMALE_31_40']

PRICE       41.833333
SEGMENTS            A
Name: TUR_ANDROID_FEMALE_31_40, dtype: object

In [395]:
agg_df.loc['FRA_IOS_FEMALE_31_40']

PRICE       32.818182
SEGMENTS            C
Name: FRA_IOS_FEMALE_31_40, dtype: object